<template lang="html">
  <div class="lottery-rule-page overflow-y f-28 column-flex">
    <article class="bg-white padding-lr-30 text-contain p-b20">
      <h3 class="text-center">竞猜投注协议</h3>
      <section class="margin-t-20">
        <p class="indent-2em">
          竞猜游戏是鹰和鹰平台（以下简称“平台”）为体育运动爱好者提供的娱乐游戏。
          请您仔细阅读以下条款，如果您对本协议的任何条款表示异议，您可以选择不确认/参与，您确认参与该游戏，则意味着您将自愿遵守以下规则，
          并完全服从于本平台的统一管理。
        </p>
      </section>
      <section>
        <p>
          1、竞猜游戏仅限鹰和鹰平台积分参与娱乐。积分使用详细见平台积分规则。
        </p>
        <p> 2、竞猜游戏实行自愿投注，凡投注该竞猜游戏者即被视为同意并遵守本规则。</p>
        <p>3、不得向未成年人推销本游戏、且禁止任何人兑付游戏积分成为现金货币。</p>
        <p>4、本平台有权根据国家相关规定、行业规范及平台发展的需要不时地制订、修改本协议及/或各类规则，
          并以网站公示的方式进行变更公告，无需另行单独通知您。变更后的协议和规则一经在网站公布后，立即或在公告明确的特定时间自动生效。
          若您在前述变更公告后继续使用平台服务的，即表示您已经阅读、理解并接受经修订的协议和规则。若您不同意相关变更，应当立即停止使用平台服务。
          平台保留随时修改或中断服务而不需知照用户的权利。主要包括以下情况：</p>
        <p>
          (1)增加或减少竞猜种类。官方长期或临时增加或减少竞猜种类均不需事先告知用户。
        </p>
        <p>(2)调整竞猜销售截止时间、赛事赛程、赛事类型的权利。官方有权根据竞猜种类和当期销售情况调整竞猜销售截止时间，而不需事先告知用户。</p>
        <p>
          5、所有下注订单将在投注后到竞猜赛事投注截止时间前，由系统完成确认过程；若确认失败，将自动取消该订单，并退回投注积分。
          若系统出现错盘、锁盘异常等情况，平台有权采取一定措施修正，措施包括且不限于：取消下注且退还积分、修正已有下注的赔率值为真实赔率值。
          比赛取消、延期/某玩法锁盘异常，导致某场比赛/某种玩法被认定为无效，则该场比赛/玩法的所有投注将无效，积分原额返还。
          （锁盘异常包括：比赛数据变化但盘口未及时变化、未及时锁盘等）。
        </p>
        <p>6、用户在使用平台提供的各项服务的同时，承诺接受并遵守平台制定的各项相关规定。
          平台有权对本协议及各类规则进行变更而无需事先通知用户，用户有权决定是否继续接受修订后的协议，详见本协议第4条。</p>
        <p>7、平台在法律许可的范围内，保留解释本协议及相关规则的权利。</p>
      </section>
    </article>
  </div>
</template>

<script>
export default {
  name: 'rule',
  data () {
    return {
      entranceList: [
        {name: '竞猜足球'},
        {name: '竞猜足球'},
        {name: '竞猜足球'}
      ]
    }
  },
  mounted () {
  }
}
</script>
<style lang="scss" scoped>
  .indent-2em{
    text-indent: 2em;
  }
  p{
    margin: 10px;
    line-height: 50px;
  }
  .padding-lr-30{
    padding-left: 30px;
    padding-right: 30px;
  }
  .lottery-rule-page{
    height: 100%;
    width: 100%;
    min-height: 100vh;
  }
  .text-contain{
    height: 100%;
  }
  .lottery-rule-page .flex-b{
    margin-bottom: 40px;
  }
  .margin-t-20{
    margin-top: 20px;
  }
</style>
